# 06 (어려움 주의)
# -------------------------------------------------------------------------
# 난이도 = 초~중급 , 버블 정렬을 활용하여 직접 커스텀 sort함수  만들어보기
# six = [3,2,7,5,9]
# def my_sort(lst = list):
    # 버블정렬 알고리즘
    # 리스트의 첫번째 요소와 두번째 요소를 비교하고, 첫번째 < 두번째 = False 라면 서로 교환
    # 두번째 요소와 세번째 요소를 비교하고 두번째 < 세번째 = False 라면 서로 교환
    # 다음은 세번째 와 네번째 ..... 에서 끝까지 비교 진행 하는 것이 1사이클
    # 이 사이클을 len(list) - 1 만큼 반복
    # 여기에 구현
#     pass
# print(my_sort(six))

# 뭔 소리인지도 모르겠고, 감도 안잡힌다면, 풀지말자.
# -------------------------------------------------------------------------
##